HEMcase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          15;
        startFace       6185;
    }
    outlet
    {
        type            patch;
        nFaces          45;
        startFace       6200;
    }
    freestreamInlet
    {
        type            patch;
        nFaces          30;
        startFace       6245;
    }
    freestream
    {
        type            patch;
        nFaces          70;
        startFace       6275;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3150;
        startFace       6345;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3150;
        startFace       9495;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          70;
        startFace       12645;
    }
)

// ************************************************************************* //
